<a href="https://colab.research.google.com/github/anmol0720/Time-Series-Forcasting/blob/master/TensorFlow_with_GPU.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
dataframe=pd.read_csv("daily-total-female-births-CA.csv",header=0)

In [10]:
dataframe.head()

         date  births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [11]:
#System is treating dates here as objects or strings
dataframe['date'].dtype

dtype('O')

To let the system identify dates as dates

In [0]:
#[0] because we have date at our first column
df2=pd.read_csv("daily-total-female-births-CA.csv",header=0,parse_dates=[0])

In [14]:
df2.head()

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [15]:
df2['date'].dtype
#Here we see that now the system identifies dates in date formate

dtype('<M8[ns]')